Lists the validation type of the fabrication part.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
  Since:  2016
 Syntax
  C#
public enum ValidationStatus
  Visual Basic
Public Enumeration ValidationStatus
  Visual C++
public enum class ValidationStatus
 Members
  Member name  |   Description
   Valid   |   The part is valid to fabrication.
   InvalidDimensions   |   The part has invalid dimensions.
   NoMaterial   |   The part has no material being specified.
 See Also
  Autodesk.Revit.DB.Fabrication Namespace